#Область ПрограммныйИнтерфейс

Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	// Контактная информация справочника "Клиенты" 
    Элемент = Элементы.Добавить(); 
    Элемент.ИмяПредопределенногоВида = "СправочникКлиенты";
    Элемент.ЭтоГруппа = Истина;
    Элемент.Используется=истина;
    Элемент.Наименование = НСтр("ru = 'Контактная информация справочника ""Клиенты""'", ОбщегоНазначения.КодОсновногоЯзыка());
    
    // Адрес Клиента
    Элемент = Элементы.Добавить();
    Элемент.Родитель = "СправочникКлиенты";
    Элемент.ИмяГруппы = "СправочникКлиенты";
    Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
    Элемент.Используется=истина;
    Элемент.ИмяПредопределенногоВида = "АдресКлиента";
    Элемент.ИдентификаторДляФормул = "АдресКлиента";
    Элемент.ВидРедактирования = "ПолеВвода";
    Элемент.ВключатьСтрануВПредставление = Ложь;
    Элемент.ХранитьИсториюИзменений = Ложь;
    Элемент.ОтображатьВсегда = Истина;
    Элемент.Наименование = НСтр("ru = 'Адрес'", ОбщегоНазначения.КодОсновногоЯзыка());	
    
    // Телефон Клиента
    Элемент = Элементы.Добавить();
    Элемент.Родитель = "СправочникКлиенты";
    Элемент.ИмяГруппы = "СправочникКлиенты";
    Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
    Элемент.Используется=истина;
    Элемент.ИмяПредопределенногоВида = "ТелефонКлиента";
    Элемент.ИдентификаторДляФормул = "ТелефонКлиента";
    Элемент.ВидРедактирования = "ПолеВвода";
    Элемент.ОтображатьВсегда = Истина;
    Элемент.Наименование = НСтр("ru = 'Телефон'", ОбщегоНазначения.КодОсновногоЯзыка());
    
    // АдресЭлектроннойПочты Клиента
    Элемент = Элементы.Добавить();
    Элемент.Родитель = "СправочникКлиенты";
    Элемент.ИмяГруппы = "СправочникКлиенты";
    Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
    Элемент.Используется=истина;
    Элемент.ИмяПредопределенногоВида = "АдресЭлектроннойПочтыКлиента";
    Элемент.ИдентификаторДляФормул = "АдресЭлектроннойПочтыКлиента";
    Элемент.ВидРедактирования = "ПолеВвода";
    Элемент.ОтображатьВсегда = Истина;
    Элемент.Наименование = НСтр("ru = 'Адрес Электронной Почты'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	// Телеграмм Клиента
    Элемент = Элементы.Добавить();
    Элемент.Родитель = "СправочникКлиенты";
    Элемент.ИмяГруппы = "СправочникКлиенты";
    Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.ВебСтраница;
    Элемент.Используется=истина;
    Элемент.ИмяПредопределенногоВида = "ТелеграммКлиента";
    Элемент.ИдентификаторДляФормул = "ТелеграммКлиента";
    Элемент.ВидРедактирования = "ПолеВвода";
    Элемент.ОтображатьВсегда = Истина;
    Элемент.Наименование = НСтр("ru = 'Телеграмм'", ОбщегоНазначения.КодОсновногоЯзыка());

КонецПроцедуры

#КонецОбласти