// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	НомерТелефонаКИ="";
	ВидКИ=УправлениеКонтактнойИнформацией.ВидКонтактнойИнформацииПоИмени("ТелефонКлиента");
	
	для каждого строкаКИ из КонтактнаяИнформация Цикл
		Если строкаКИ.Вид=ВидКИ тогда
			НомерТелефонаКИ=строкаКИ.Представление;	
		КонецЕсли;	
	КонецЦикла;
	
	НормализованныйТелефон = НомераТелефоновКлиентСервер.НормализованныйНомерТелефона(НомерТелефонаКИ, Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
